# Приложение для бухгалтерии

## Цель проекта

Цель данного проекта — упростить рабочие процессы в отделе бухгалтерии. В настоящее время для ведения бюджета используются простые excel-таблицы, которые часто приводят к ошибкам при вводе данных и расчетах.

**Нужно реализовать в приложении такую функциональность:**

- `Консольный интерфейс для управления программой.`
- `Считывание месячных и годового отчётов бухгалтерии из файлов и их перевод в объекты приложения.`
- `Сверка данных по месячным и годовому отчётам.`
- `Вывод информации о месячных и годовом отчётах.`

## Проблематика

- Постоянные ошибки при вводе данных
- Сложность подсчета баланса
- Неэффективное использование рабочего времени

## Функциональность

### Консольный интерфейс

Приложение будет обладать простым и понятным консольным интерфейсом для управления программой.

### Считывание отчётов

- **Месячные отчёты**: Программа сможет считывать месячные отчёты бухгалтерии из файлов и переводить их в объекты приложения.
- **Годовые отчёты**: Аналогичная функциональность будет реализована для годовых отчётов.

### Сверка данных

Программа будет сверять данные по месячным и годовым отчётам, чтобы исключить или минимизировать ошибки.

### Вывод информации

Пользователи смогут просматривать информацию о месячных и годовых отчётах прямо в консольном интерфейсе.

## Данные для разработки

Для разработки приложения бухгалтерия готова предоставить три месячных отчёта: за январь, февраль и март 2021 года, а также частичный годовой отчёт за эти же три месяца.

---

**Внимание**: В текущей версии приложение обрабатывает только данные за первый квартал 2021 года.



## Стартовые вводные

### Формат входных файлов

Бухгалтерия готова предоставить данные в формате **CSV — Comma-Separated Values** (англ. "значения, разделённые запятыми"). В этих файлах:

- **Первая строка**: Заголовки столбцов
- **Остальные строки**: Значения, разделённые символом-разделителем — запятой.

#### Пример таблицы в текстовом редакторе

| item                 | price | available_by_delivery |
|----------------------|-------|-----------------------|
| Полотенце            | 200   | TRUE                  |
| Холодильник          | 10000 | FALSE                 |
| Чайник электрический | 900   | TRUE                  |
| Тостер               | 1000  | TRUE                  |
| Духовка              | 7500  | FALSE                 |

#### Пример в формате CSV

```plaintext
item,price,available_by_delivery
Полотенце,200,TRUE
Холодильник,10000,FALSE
Чайник электрический,900,TRUE
Тостер,1000,TRUE
Духовка,7500,FALSE
```

Теперь программе достаточно "разрезать" строку по разделителям-запятым. Это позволит создать массив элементов, в котором под одним и тем же индексом всегда будет объект из соответствующей колонки. Например, в каждой строке элемент под индексом [1] будет соответствовать цене.

### Типы файлов-отчётов
Приложение будет работать с двумя типами файлов:

- **Месячные отчёты**
- **Годовые отчёты**


Каждый файл будет разбит на составляющие и преобразован в объекты приложения.

## Месячный отчёт

### Общая информация

Месячный отчёт содержит данные о доходах и расходах за один календарный месяц.

### Имена месячных отчётов

Файлы с месячными отчётами имеют определенный формат именования:

- **m.YYYYMM.csv**, где:
    - `m` — буква "m", чтобы отличить месячные отчёты от годовых.
    - `YYYY` — четыре цифры года.
    - `MM` — две цифры месяца.

**Примеры:**

- `m.202001.csv` — месячный отчёт за январь 2020 года.
- `m.201912.csv` — месячный отчёт за декабрь 2019 года.

### Пример CSV-файла с месячным отчётом

```plaintext
item_name,is_expense,quantity,unit_price
Воздушные шарики,TRUE,5000,5
Автоматы с мороженым,TRUE,12,15000
Продажа мороженого,FALSE,1000,120
```

#### Пример таблицы в текстовом редакторе

| Field      | Description                                    | Type    |
|------------|------------------------------------------------|---------|
| item_name  | Название товара или услуги                     | String    |
| is_expense | Является ли тратой (TRUE) или доходом (FALSE)  | Boolean   |
| quantity   | Количество закупленного или проданного товара	 | Integer    |
| unit_price | Стоимость одной единицы товара	                | Integer    |


### Класс месячного отчёта

Класс для хранения данных месячного отчёта называется MonthlyReport.

## Технические требования

### Общие замечания

В начале ТЗ уже обозначено, что приложение должно иметь консольный интерфейс и выполнять ряд функций, таких как считывание месячных и годовых отчётов, их сверку, а также вывод информации о них. Далее подробно о каждой функциональности.

### 1. Консольный интерфейс

Консольный интерфейс должен предлагать 5 основных действий:

1. **Считать все месячные отчёты**: Прочитать и сохранить данные из файлов месячных отчётов.
    - 💡 Файлы для считывания:
        - `m.202101.csv`
        - `m.202102.csv`
        - `m.202103.csv`

2. **Считать годовой отчёт**: Прочитать и сохранить данные из файла годового отчёта.
    - 💡 Файл для считывания:
        - `y.2021.csv`

3. **Сверить отчёты**: Сверить сохранённые данные месячных и годового отчёта.

4. **Вывести информацию о месячных отчётах**: Вывести сохраненные данные месячных отчётов.

5. **Вывести информацию о годовом отчёте**: Вывести сохраненные данные годового отчёта.

После выполнения одного из действий, программа должна предложить оператору выбрать следующее действие.

> **Примечание**: Завершение работы программы должно происходить только при вводе специальной последовательности символов, которую нужно определить самостоятельно.

### 2. Считывание файлов

Считывание файлов должно приводить к созданию объектов в программе для дальнейшей их обработки.


## 3. Сверка данных

Сверка данных — это проверка согласованности данных между двумя и более источниками. В контексте нашего приложения это значит, что нужно удостовериться, что данные в годовом отчёте согласуются с данными в месячных отчётах.

### Шаги для сверки данных:

1. **Проверка чтения отчётов**: Удостовериться, что месячные и годовой отчёты были успешно считаны из файлов. Если это не так, предложить пользователю сначала прочитать данные.
2. **Подсчёт сумм**: Рассчитать суммы доходов и расходов для каждого месяца.
3. **Сравнение сумм**: Сверить полученные суммы с данными в годовом отчёте.
4. **Результаты сверки**:
    - При обнаружении несоответствий, программа должна вывести номер месяца, где было обнаружено несоответствие.
    - Если несоответствий не обнаружено, программа должна сообщить об успешной проверке.

## 4. Вывод информации

Приложение должно уметь выводить информацию из месячных и годовых отчётов.

### Информация из месячных отчётов

При вызове соответствующей функции программа должна выводить:

- **Название месяца**
- **Самый прибыльный товар**: Название и сумму.
- **Самая большая трата**: Название и сумму.

🔥 **Важно**: Перед выводом информации удостовериться, что месячные отчёты были считаны из файлов.

### Информация из годового отчёта

При вызове функции для вывода годового отчёта, программа должна показывать:

- **Рассматриваемый год**
- **Прибыль по месяцам**
- **Средний расход за все операции**
- **Средний доход за все операции**

🔥 **Важно**: Перед выполнением подсчётов убедиться, что годовой отчёт был считан из файла.


````
import java.io.IOException;
import java.nio.file.Files;
import java.nio.file.Path;
import java.util.ArrayList;

public class FileReader {
    ArrayList<String> readFileContents(String fileName) {
        String path = "./resources/" + fileName;
        try {
            return new ArrayList<>(Files.readAllLines(Path.of(path)));
        } catch (IOException e) {
            System.out.println("Невозможно прочитать файл с отчётом. Возможно, файл отсутствует в нужной директории.");
            return new ArrayList<>();
        }
    }

}
````